# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 1 - Первое знакомство                                #
# Урок 1.2 - Варианты выполнения команд. Переходим в PyCharm  #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/566989                  #
# ----------------------------------------------------------- #
#           Шаг 3/3                                           #
# ----------------------------------------------------------- #

# Подвиг 2. С помощью функции print выведите сумму двух чисел 6+7

# ----------------------------------------------------------- #
print(6 + 7)