#-------------------------------------------------------------#
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
#-------------------------------------------------------------#
# Курс "Поколение Python": Курс для начинающих                #
#                                                             #
# Модуль 1 - Первое знакомство                                #
# Урок 1.2 - Варианты выполнения команд. Переходим в PyCharm  #
# Шаг 2                                                       #
#-------------------------------------------------------------#
#     https://stepik.org/lesson/566989/step/2?unit=561263     #
#-------------------------------------------------------------#

print("Hello Python!")