# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Курс "Поколение Python": Курс для начинающих                #
#                                                             #
# Модуль 1 - Первое знакомство                                #
# Урок 1.2 - Варианты выполнения команд. Переходим в PyCharm  #
# Шаг 2/3                                                     #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/566989/step/2           #
# ----------------------------------------------------------- #

# Подвиг 1. С помощью функции print выведите сообщение "Hello Python!" (без кавычек).

# ----------------------------------------------------------- #
print("Hello Python!")