# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.4 - Функции print и input                            #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567023                  #
# ----------------------------------------------------------- #
#           Шаг 9/13                                          #
# ----------------------------------------------------------- #

# Подвиг 8. Напишите программу, которая принимает на вход два
#           вещественных числа в одну строку через пробел и
#           выводит на экран их сумму.

# ----------------------------------------------------------- #

# ввод данных
a, b = map(float, input().split())

# здесь продолжите программу
print(a + b)