# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.4 - Функции print и input                            #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567023                  #
# ----------------------------------------------------------- #
#           Шаг 2/13                                          #
# ----------------------------------------------------------- #

# Подвиг 1. В программе определите три следующие переменные:
#               a = 7
#               b = -4
#               c = 3
#           Выведите в консоль их значения, используя одну функцию print
#           (между значениями переменных должен стоять один пробел).

# ----------------------------------------------------------- #

a = 7
b = -4
c = 3
print( a, b, c)