# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.4 - Функции print и input                            #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567023                  #
# ----------------------------------------------------------- #
#           Шаг 6/13                                          #
# ----------------------------------------------------------- #

# Подвиг 5. Напишите программу, в которой вводятся два целых
#           положительных числа и в консоль выводится результат
#           возведения первого числа в степень второго.

# ----------------------------------------------------------- #

# ввод данных
a, b = map(int, input().split())

# здесь продолжите программу
print(pow(a, b))