# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.4 - Функции print и input                            #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567023                  #
# ----------------------------------------------------------- #
#           Шаг 11/13                                         #
# ----------------------------------------------------------- #

# Подвиг 10. Вводятся длина и ширина прямоугольника (каждое
#            вещественное значение с новой строки). Необходимо
#            вычислить его периметр (сумму длин сторон)
#            и результат вывести на экран.

# ----------------------------------------------------------- #

# ввод данных
X, Y = float(input()), float(input())

# здесь продолжите программу
print((2 * X) + (2 * Y))