# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.4 - Функции print и input                            #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567023                  #
# ----------------------------------------------------------- #
#           Шаг 13/13                                         #
# ----------------------------------------------------------- #

# Подвиг 12. Составить программу вывода на экран вещественного числа,
#            вводимого с клавиатуры. Выводимому числу должно
#            предшествовать сообщение "Вы ввели число" (без кавычек).

# ----------------------------------------------------------- #
print("Вы ввели число", input())