# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.4 - Функции print и input                            #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567023                  #
# ----------------------------------------------------------- #
#           Шаг 12/13                                         #
# ----------------------------------------------------------- #

# Подвиг 11. Напишите программу вывода переменной math.pi
#            с точностью до тысячных (три знака после запятой).

# ----------------------------------------------------------- #
from math import pi
print(round(pi, 3))