# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.4 - Функции print и input                            #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567023                  #
# ----------------------------------------------------------- #
#           Шаг 4/13                                          #
# ----------------------------------------------------------- #

# Подвиг 3. В программе определите две следующие строки:
#               s1 = "Hello"
#               s2 = "Balakirev"
#           С помощью двух функций print (каждая отображает 
#           соответствующую строку) отобразите строки в консоли так,
#           чтобы они шли друг за другом через пробел.

# ----------------------------------------------------------- #

s1 = "Hello"
s2 = "Balakirev"
print(s1, s2)