# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.3 - Математические функции и модуль math             #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567022                  #
# ----------------------------------------------------------- #
#           Шаг 6/9                                           #
# ----------------------------------------------------------- #

# Подвиг 5. Допишите текст программы для вычисления евклидового
#           расстояния (гипотенузы) по перемещениям a и b (формула:
#           sqrt(a**2 + b**2)). Округлите результат с точностью до сотых. 
#           Полученное значение выведите на экран.

# ----------------------------------------------------------- #

from math import sqrt, pow

# ввод данных
a, b = map(int, input().split())

# здесь продолжите программу
print(round(sqrt(pow(a, 2) + pow(b, 2)), 2))