# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.3 - Математические функции и модуль math             #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567022                  #
# ----------------------------------------------------------- #
#           Шаг 4/9                                           #
# ----------------------------------------------------------- #

# Подвиг 3. Допишите текст программы для нахождения максимального
#           значения из пяти введенных целых чисел с выводом
#           результата в консоль с помощью функции print. 

# ----------------------------------------------------------- #

# ввод целого числа
d1, d2, d3, d4, d5 = map(int, input().split())

# здесь продолжите программу
print(max(d1, d2, d3, d4, d5))