# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Добрый, добрый Python - обучающий курс от Сергея Балакирева #
# ----------------------------------------------------------- #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.4 - Логический тип Bool. Операторы сравнения         #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567024                  #
# ----------------------------------------------------------- #
#           Шаг 6/12                                          #
# ----------------------------------------------------------- #

# Подвиг 5. Вводится вещественное число. Нужно определить,
#           что его целая часть кратна 3. На экран вывести True,
#           если кратно и False - в противном случае. Задача
#           делается без использования условного оператора.

# ----------------------------------------------------------- #

number = float(input())
print(int(number) % 3 == 0)