# ----------------------------------------------------------- #
# DATE: 2023.07.16                                            #
# AUTHOR: Maxim Datskiy                                       #
# GitHub: https://github.com/immmax                           #
# Stepik: https://stepik.org/users/525951056/profile          #
# ----------------------------------------------------------- #
# Курс "Поколение Python": Курс для начинающих                #
#                                                             #
# Модуль 2 - Мои первые шаги в Python                         #
# Урок 2.3 - Математические функции и модуль math             #
# Шаг 2                                                       #
# ----------------------------------------------------------- #
#           https://stepik.org/lesson/567022/step/2           #
# ----------------------------------------------------------- #

# Подвиг 2. Допишите текст программы для вычисления модуля 
#           введенного с клавиатуры числа в переменную d и
#           вывода значения в консоль с помощью функции print.

# ----------------------------------------------------------- #

# ввод целого числа
d = int(input())

# здесь продолжите программу
print(abs(d))